/*------------------------------------------------------------------------------
 | Copyright (c) 2014,南京普天通信股份有限公司.
 | All rights reserved.
 |------------------------------------------------------------------------------
 | 文件名称： Silion labs-sim3u146 接口板完整程序
 | 文件批号： 详见任务计划书
 | 简单摘要： 
 |------------------------------------------------------------------------------
 | 当前版本： 1.1
 | 作   者： Mingliang.Lu
 | 完成时间：2014-07-15 
 |------------------------------------------------------------------------------
 | 原版本 ： 1.0
 | 作  者：  MingLiang.lu
 | 完成时间：2013-05-20
 |------------------------------------------------------------------------------
 | 若有问题，可联系: linux.lucian@gmail.com
 |------------------------------------------------------------------------------
 */

#ifndef __MYCRC_H__
#define __MYCRC_H__

#include <stdbool.h>
#include <stdint.h>

#define CRC_ERROR    0
#define CRC_OK       1

void delay(uint32_t times_cnt);
uint8_t crc8(uint8_t* ptr,uint16_t len);
uint8_t  app_calccrc8(uint8_t *dat, uint16_t datlen);

#endif //__MYCRC_H__

